Repository: minetest-mods/castle_gates
Catalog: locale/*.po
Languages: es

source: Heavy wooden bars designed to prevent entry even to siege equipment.
es: Barras de madera pesadas diseñadas para evitar la entrada incluso a equipo de asedio

source: Place these bars in a structure together and they will slide as a unified gate when clicked on.
es: Coloque estas barras en una estructura juntas y se deslizarán como si estuvieran unidas cuando se le hace clic

source: The bottom edge of a portcullis gate, with knobs to lock securely into the floor.
es: Es el borde inferior de una puerta rastrillo, con perillas para bloquearla con seguridad en el piso

source: This block can be used to define the edge of a portcullius that meets up with another gate, should you have an arrangement like that. Otherwise it's just decorative.
es: Este bloque puede ser usado para definir el borde de una puerta rastrillo que esta cerca de otra puerta, si tiene varias puertas independientes, de lo contrario es simplemente decorativo

source: A basic gate panel.
es: Un panel básico de puerta

source: This gate segment will move in unison with adjoining gate segments when right-clicked.
es: Este segmento de puerta se moverá junto con los demas segmentos de puerta adyacente cuando se haga clic con el botón derecho del ratón

source: A gate panel with a defined edge.
es: Un panel de puerta con un borde.

source: The darkened edge of this panel marks the edge of the gate it's a part of. You can use these when building double doors to ensure the two parts swing separately, for example. Note that edges aren't strictly necessary for gates that stand alone.
es: El borde oscurecido de este panel marca el limite de la puerta.Usted puede utilizar estos bloques para construir puertas dobles para asegurar que las dos puertas funcionen por separado, por ejemplo. Tenga en cuenta que los bordes no son estrictamente necesarios para las puertas individuales

source: A gate edge with a handle.
es: Un panel de puerta con pestillo

source: The handle is basically decorative, a door this size can be swung by clicking anywhere on it. But the darkened edge of this panel is useful for defining the edge of a gate when it abuts a partner to the side.
es: El pestillo es básicamente decorativo, una puerta de este tamaño se puede abrir haciendo clic en cualquier parte de ella. Pero el borde oscuro de este panel es útil para definir el borde de la puerta cuando hay otra puerta al lado.

source: A hinged gate segment that allows a gate to swing.
es: Un segmento de puerta con bisagra permite que la puerta se abra.

source: If you have more than one hinge in your gate, make sure the hinges line up correctly otherwise the gate will not be able to swing. The hinge is the protruding block along the edge of the gate panel.
es: Si tiene más de una bisagra en su puerta, asegúrese de que las bisagras se alineen correctamente, de lo contrario la puerta no será capaz de abrirse. la bisagra es el bloque sobresaliente a lo largo del borde del panel de la puerta.

source: A block with a slot to allow an adjacent sliding gate through.
es: Un bloque con una ranura en el medio para que una puerta deslizante pueda pasar a través de ella.

source: This block is designed to extend into a neighboring node that a sliding gate passes through, to provide a tight seal for the gate to move through without allowing anything else to squeeze in.
es: Este bloque está diseñado para un nodo pueda deslizarse a travéz de este, para proporcionar un cierre hermético que solo deja pasar la puerta sin permitir entrar nada mas.

source: A block that extends into an adjacent node to provide a tight seal for a large gate.
es: Un bloque con una ranura en el lado para que una puerta deslizante pueda pasar a través de ella.

source: Two nodes cannot occupy the same space, but this block extends into a neighboring node's space to allow for gates to form a tight seal. It can be used with sliding gates or swinging gates.
es: Dos nodos no pueden utilizar el mismo espacio, pero este nodo se extiende al espacio de un nodo vecino para permitir que las puertas formen un cierre hermético. Puede utilizarse con puertas deslizantes y con las puertas que se abren rotando.

source: Gates
es: Puertas

source: Gates are large multi-node constructions that swing on hinges or slide out of the way when triggered.
es: Las puertas grandes son construcciones multi nodo que se abren usando bisagras o se deslizan hacia arriba cuando se activan

source: Gate construction
es: Construcción de Puertas

source: Gates are multi-node constructions, usually (though not always) consisting of multiple node types that fit together into a unified whole. The orientation of gate nodes is significant, so a screwdriver will be a helpful tool when constructing gates. A gate's extent is determined by a "flood fill" operation. When you trigger a gate block, all compatible neighboring blocks will be considered part of the same structure and will move in unison. Only gate blocks that are aligned with each other will be considered part of the same gate. If you wish to build adjoining gates (for example, a large pair of double doors that meet in the center) you'll need to make use of gate edge blocks to prevent it all from being considered one big door. Note that if your gate does not abut any other gates you don't actually need to define its edges this way - you don't have to use edge blocks in this case. If a gate has no hinge nodes it will be considered a sliding gate. When triggered, the gate code will search for a direction that the gate can slide in and will move it in that direction at a rate of one block-length per second. Once it reaches an obstruction it will stop, and when triggered again it will try sliding in the opposite direction. If a gate has hinge nodes then triggering it will cause the gate to try swinging around the hinge. If the gate has multiple hinges and they don't line up properly the gate will be unable to move. Note that the gate can only exist in 90-degree increments of orientation, but the gate still looks for obstructions in the region it is swinging through and will not swing if there's something in the way.
es: Las puertas son generalmente construcciones multi nodo (aunque no siempre), que consisten de múltiples tipos de nodos que se acomodan en un todo unificado. La orientación de los nodos de la puerta es importante, por lo que un destornillador será útil para construir las puertas. La extención de una puerta se determina mediante una operación de "Llenado de Inundación". Al activar un bloque de la puerta, todos los bloques vecinos compatibles se considerán parte de la misma estructura y se moveran al unísono. Sólo los bloques de compuerta que estén alineados entre sí se considerarán parte de la misma puerta. Si desea construir puertas adyacentes (por ejemplo, un gran par de puertas dobles que se abran en el centro) tendrá que hacer uso de bloques de borde de puerta para evitar que todo sea considerado solo una gran puerta. Tenga en cuenta que si su puerta no se apoya en ninguna otra puerta, no necesita usar los bordes de puerta en este caso. Si una puerta no tiene nodos de bisagra se considerará una puerta deslizante. Cuando se ejecuta el codigo de la puerta buscará una dirección en la que la puerta pueda deslizarse y se moverá en esa dirección a una velocidad de un bloque por segundo. Una vez que llega a una obstrucción se detendrá, y cuando se ejecute de nuevo tratará de deslizarse en la dirección opuesta. Si una puerta tiene nodos de bisagra, entonces al activar la puerta tratara de girar al rededor de la bisagra. Si la puerta tiene bisagras múltiples y no estan bien alineadas, la puerta no podrá moverse. Tenga en cuenta que la puerta sólo puede existir en incrementos de 90 grados de orientación, pero la puerta todavía busca obstrucciones en la región que está moviéndose y no girara si hay algo en el camino.

source: Oak Door
es: Puerta de Roble

source: Jail Door
es: Puerta de Cárcel

source: Stonebrick
es: Ladrillo de Piedra

source: @1 Gate Slot
es: Espacio para Puerta de @1

source: @1 Gate Slot Reverse
es: Espacio para Puerta Invertido de @1

source: Portcullis Bars
es: Barras de la Puerta Rastrillo

source: Portcullis Bottom
es: Terminación de la Puerta Rastrillo

source: Gate Door
es: Porción de la Puerta

source: Gate Door Edge
es: Borde de la Puerta

source: Gate Door With Handle
es: Pestillo de la Puerta

source: Gate Door With Hinge
es: Bisagra de la Puerta
